#### Zadanie V: Filtrowanie danych

W tym zadaniu będziesz miał okazję przećwiczyć różne metody filtrowania danych w Pandas, aby wyodrębnić interesujące informacje z zestawu danych o pracownikach firmy. Każde z podzadań dotyczy innej techniki filtrowania, co pozwoli Ci zyskać szersze umiejętności w pracy z Pandas.

**0. Wczytanie danych**

Wczytaj dane z pliku 'data/employees.csv' i zapoznaj się z nimi wstępnie.

In [2]:
import pandas as pd

# Wczytanie danych z pliku CSV
df = pd.read_csv('data/employees.csv')
df

   employee_id first_name last_name   department  salary  age joining_date
0            1       John       Doe  Engineering   70000   28   2020-01-15
1            2       Jane     Smith    Marketing   60000   34   2019-03-22
2            3        Bob     Brown  Engineering   80000   45   2018-06-10
3            4      Alice   Johnson           HR   50000   29   2021-09-05
4            5      Chris     Davis  Engineering   75000   40   2017-11-30
5            6      Emily    Wilson    Marketing   65000   36   2019-02-12
6            7    Michael    Garcia           HR   55000   30   2021-04-18
7            8      Sarah  Martinez  Engineering   72000   31   2020-05-23
8            9      David  Anderson    Marketing   58000   50   2016-08-09
9           10      Linda    Thomas           HR   52000   25   2022-11-14

**1. Wyświetlenie wszystkich pracowników z działu "Engineering"**

Użyj metody `isin`, aby wybrać wszystkich pracowników z działu "Engineering".

In [6]:
# Filtrowanie pracowników z działu Engineering
df['department'].isin(['Engineering'])

0     True
1    False
2     True
3    False
4     True
5    False
6    False
7     True
8    False
9    False
Name: department, dtype: bool

In [7]:
df[df['department'].isin(['Engineering'])]

   employee_id first_name last_name   department  salary  age joining_date
0            1       John       Doe  Engineering   70000   28   2020-01-15
2            3        Bob     Brown  Engineering   80000   45   2018-06-10
4            5      Chris     Davis  Engineering   75000   40   2017-11-30
7            8      Sarah  Martinez  Engineering   72000   31   2020-05-23

**2. Pracownicy, których nazwiska zaczynają się na literę "S"**

Użyj str accessor, aby wyświetlić wszystkich pracowników, których nazwiska zaczynają się na "S".

In [9]:
# Filtrowanie pracowników, których nazwiska zaczynają się na "S"
df['last_name'].str.startswith('S')

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: last_name, dtype: bool

In [10]:
df[df['last_name'].str.startswith('S')]

   employee_id first_name last_name department  salary  age joining_date
1            2       Jane     Smith  Marketing   60000   34   2019-03-22

**3. Wybór pracowników z wynagrodzeniem większym niż 60,000**

Użyj warunku w kwadratowych nawiasach, aby wybrać pracowników, których wynagrodzenie jest wyższe niż 60,000.

In [11]:
# Filtrowanie pracowników z wynagrodzeniem większym niż 60,000
df['salary'] > 60000

0     True
1    False
2     True
3    False
4     True
5     True
6    False
7     True
8    False
9    False
Name: salary, dtype: bool

In [12]:
df[df['salary'] > 60000]

   employee_id first_name last_name   department  salary  age joining_date
0            1       John       Doe  Engineering   70000   28   2020-01-15
2            3        Bob     Brown  Engineering   80000   45   2018-06-10
4            5      Chris     Davis  Engineering   75000   40   2017-11-30
5            6      Emily    Wilson    Marketing   65000   36   2019-02-12
7            8      Sarah  Martinez  Engineering   72000   31   2020-05-23

**4. Pracownicy, którzy dołączyli do firmy przed 2020 rokiem**

Użyj metody `query`, aby wyświetlić pracowników, którzy dołączyli do firmy przed 2020 rokiem.

In [15]:
# Filtrowanie pracowników, którzy dołączyli przed 2020 rokiem
df.query('joining_date < "2020-01-01"')

   employee_id first_name last_name   department  salary  age joining_date
1            2       Jane     Smith    Marketing   60000   34   2019-03-22
2            3        Bob     Brown  Engineering   80000   45   2018-06-10
4            5      Chris     Davis  Engineering   75000   40   2017-11-30
5            6      Emily    Wilson    Marketing   65000   36   2019-02-12
8            9      David  Anderson    Marketing   58000   50   2016-08-09

**5. Najwyżej opłacani pracownicy**

Użyj metody `nlargest`, aby wybrać trzech najwyżej opłacanych pracowników.

In [16]:
# Najwyżej opłacani pracownicy
df.nlargest(3, 'salary')

   employee_id first_name last_name   department  salary  age joining_date
2            3        Bob     Brown  Engineering   80000   45   2018-06-10
4            5      Chris     Davis  Engineering   75000   40   2017-11-30
7            8      Sarah  Martinez  Engineering   72000   31   2020-05-23

**6. Najniżej opłacani pracownicy**

Użyj metody `nsmallest`, aby wybrać dwóch najniżej opłacanych pracowników.

In [17]:
# Najniżej opłacani pracownicy
df.nlargest(2, 'salary')

   employee_id first_name last_name   department  salary  age joining_date
2            3        Bob     Brown  Engineering   80000   45   2018-06-10
4            5      Chris     Davis  Engineering   75000   40   2017-11-30

**7. Wyświetlenie wszystkie dane dla pracowników w wieku między 30 a 40 lat**

Użyj loc, aby wybrać pracowników, którzy mają od 30 do 40 lat.

In [19]:
# Filtrowanie pracowników w wieku 30-40 lat
(df['age'] >= 30) & (df['age'] <= 40)

0    False
1     True
2    False
3    False
4     True
5     True
6     True
7     True
8    False
9    False
Name: age, dtype: bool

In [20]:
df.loc[(df['age'] >= 30) & (df['age'] <= 40)]

   employee_id first_name last_name   department  salary  age joining_date
1            2       Jane     Smith    Marketing   60000   34   2019-03-22
4            5      Chris     Davis  Engineering   75000   40   2017-11-30
5            6      Emily    Wilson    Marketing   65000   36   2019-02-12
6            7    Michael    Garcia           HR   55000   30   2021-04-18
7            8      Sarah  Martinez  Engineering   72000   31   2020-05-23

**8. Wybór pracowników na podstawie ich ID**

Użyj `iloc`, aby wybrać pracowników o indeksach 1, 3 i 5.

In [21]:
# Wybór pracowników o indeksach 1, 3 i 5
df.iloc[[1, 3, 5]]

   employee_id first_name last_name department  salary  age joining_date
1            2       Jane     Smith  Marketing   60000   34   2019-03-22
3            4      Alice   Johnson         HR   50000   29   2021-09-05
5            6      Emily    Wilson  Marketing   65000   36   2019-02-12

**9. Wyświetlenie wszystkich pracowników z działu "HR" lub "Marketing"**

Użyj metody `isin`, aby wyświetlić wszystkich pracowników, którzy są w działach "HR" lub "Marketing".

In [22]:
# Filtrowanie pracowników z działu HR lub Marketing
df[df['department'].isin(['HR', 'Marketing'])]

   employee_id first_name last_name department  salary  age joining_date
1            2       Jane     Smith  Marketing   60000   34   2019-03-22
3            4      Alice   Johnson         HR   50000   29   2021-09-05
5            6      Emily    Wilson  Marketing   65000   36   2019-02-12
6            7    Michael    Garcia         HR   55000   30   2021-04-18
8            9      David  Anderson  Marketing   58000   50   2016-08-09
9           10      Linda    Thomas         HR   52000   25   2022-11-14

**10. Wyświetlenie pracowników z wynagrodzeniem poniżej mediany**

Użyj kwadratowych nawiasów i funkcji median, aby znaleźć pracowników zarabiających mniej niż mediana wynagrodzenia.

In [24]:
# Filtrowanie pracowników zarabiających mniej niż mediana wynagrodzenia
df['salary'].median()

62500.0

In [25]:
df['salary'] < df['salary'].median()

0    False
1     True
2    False
3     True
4    False
5    False
6     True
7    False
8     True
9     True
Name: salary, dtype: bool

In [26]:
df[df['salary'] < df['salary'].median()]

   employee_id first_name last_name department  salary  age joining_date
1            2       Jane     Smith  Marketing   60000   34   2019-03-22
3            4      Alice   Johnson         HR   50000   29   2021-09-05
6            7    Michael    Garcia         HR   55000   30   2021-04-18
8            9      David  Anderson  Marketing   58000   50   2016-08-09
9           10      Linda    Thomas         HR   52000   25   2022-11-14

**11. Pracownicy, którzy nie pracują w dziale "Marketing"**

Użyj negacji (~) oraz isin, aby wybrać wszystkich pracowników, którzy nie są w dziale "Marketing".

In [27]:
# Filtrowanie pracowników, którzy nie są w dziale Marketing
df[~(df['department'].isin(['Marketing']))]

   employee_id first_name last_name   department  salary  age joining_date
0            1       John       Doe  Engineering   70000   28   2020-01-15
2            3        Bob     Brown  Engineering   80000   45   2018-06-10
3            4      Alice   Johnson           HR   50000   29   2021-09-05
4            5      Chris     Davis  Engineering   75000   40   2017-11-30
6            7    Michael    Garcia           HR   55000   30   2021-04-18
7            8      Sarah  Martinez  Engineering   72000   31   2020-05-23
9           10      Linda    Thomas           HR   52000   25   2022-11-14

**12. Wybór pierwszych 5 pracowników z wybraną kolumną salary przy użyciu iloc**

Użyj `iloc`, aby wybrać pierwsze 5 wierszy oraz tylko kolumnę salary.

In [29]:
# Wybór pierwszych 5 pracowników oraz kolumny salary przy użyciu `iloc`
# first_five_salaries = df.iloc[:5, df.columns.get_loc('salary')]
df.iloc[:5, df.columns.get_loc('salary')]

0    70000
1    60000
2    80000
3    50000
4    75000
Name: salary, dtype: int64

**13. Wybór pierwszych 5 pracowników z wybraną kolumną salary przy użyciu loc**

Użyj `loc`, aby wybrać pierwsze 5 wierszy oraz tylko kolumnę salary.

In [30]:
# Wybór pierwszych 5 pracowników oraz kolumny salary przy użyciu `loc`
df.loc[:4, 'salary']

0    70000
1    60000
2    80000
3    50000
4    75000
Name: salary, dtype: int64

**14. Wyciąganie wierszy od 2 do 4 (nie wliczając 4) oraz kolumny first_name i salary przy użyciu `iloc`**

Użyj `iloc`, aby wyciągnąć wiersze od 2 do 4 oraz wybrane kolumny.

In [34]:
# Wyciąganie wierszy od 2 do 4 oraz kolumn first_name i salary
df.iloc[1:5, [df.columns.get_loc('first_name'), df.columns.get_loc('salary')]]

  first_name  salary
1       Jane   60000
2        Bob   80000
3      Alice   50000
4      Chris   75000